{
  "CuisineProject":
  [
    {"CuisineName":"Coq Au Vin","CuisineDescription":"Coq au vin is a French chicken stew in which chicken thighs are braised in a red wine sauce with bacon, mushrooms, and herbs. It may sound fancy, but it's really not difficult to make at home.","CuisineWebsite":"https://www.allrecipes.com/recipe/239230/chef-johns-coq-au-vin/","CuisineImage":"https://raw.githubusercontent.com/HongxinZheng/JSONProjectsIT315/master/CoqAuVin.jpg","CuisineIngredient":"Bone-in, skin-on Chicken thighs, salt, black pepper, bacon, mushroom, onion, shallot, flour, butter, favorite wine, thyme, and broth","CuisineMake":"1. Season the chicken, cook the bacon, and cook the chicken in the bacon drippings.\n2. Sauté the vegetables until they're caramelized.\n3. Add flour and butter to the veggie mixture.\n4. Transfer to the oven and cook for 30 minutes, basting with pan juices.\n5. Return the pan to the stove and reduce the juices until the sauce thickens.","CuisineTime":"1 hr 30 mins","RecommendedAddress":"10301 Rte 1 Richmond, VA 23237","Restaurant":"Half Way House"},
    {"CuisineName":"Seafood Paella","CuisineDescription":"The most popular version of paella is this seafood paella, or paella de marisco. It became popular on the sunny beaches of Valencia and Barcelona with visitors from around the world.  This variation of paella is packed with fresh fish, shrimp, squid, mussels, and clams, but the real treasure is the rice.  Cooked with saffron and seafood broth, the rice is a sensation all on its own!","CuisineWebsite":"https://spanishsabores.com/seafood-paella-recipe/","CuisineImage":"https://raw.githubusercontent.com/HongxinZheng/JSONProjectsIT315/master/Paella.jpg","CuisineIngredient":"Rice, tomato, squid, shirmp & mussels, lemon, garlic, onion, olive oil, seafood stock, saffron, paprika, and white wine","CuisineMake":"1. Heat the seafood stock and white wine with a pinch of saffron in a pot. Keep this warm until you need it later; the saffron will infuse into the broth.\n2. Add olive oil to a large paella pan and start making the sofrito. Sauté the diced onion until translucent, and then add the minced garlic and sauté for a few more minutes.\n3. Next, add the diced tomatoes, paprika, and a pinch of salt.\n4. Stir and cook the sofrito until it has a jam-like texture. The secret to a good sofrito is a bit of time!\n5. Add the squid to coat for one minute and add the rice to simmer on low for 10 minutes.\n6. Add the shirmp and cook for another 10 minutes. In the meanwhile, steam the mussels in a pot with a few minutes. Finally, add the mussels to the rice!","CuisineTime":"1 hr","RecommendedAddress":"4017 MacArthur Ave Richmond, VA 23227",“Restaurant”:"DEMI's"},
    {"CuisineName":"French Onion Soup Gratinee","CuisineDescription":"French onion soup is a hearty vegetable soup made with caramelized onions and beef broth. The term gratinée comes from the way the soup is served: in small ramekins with a toasted slice of french bread on the top and bottom and melted gruyere cheese over the top.  The bread inside the bowl serves to thicken the soup. It absorbs the rich beef broth flavor and becomes a soft, textural element in every bite. The top crouton also dissolves a bit into the soup, but it maintains its crisp edges for some crunch. And the savory gruyere adds wonderful richness to an otherwise simple meal.","CuisineWebsite":"https://www.munchery.com/blog/you-can-do-it-french-onion-soup/","CuisineImage":"https://raw.githubusercontent.com/HongxinZheng/JSONProjectsIT315/master/onion-soup.jpg","CuisineIngredient":"Yellow onion, olive oil, salt, flour, white wine, beef broth, leaves, thyme, vinegar, bread, and Gruyere","CuisineMake":"1. Start by heating the oil in your stockpot over medium heat. Add the sliced onions and sprinkle them with salt. Cook until softened and translucent, about 10 minutes, stirring regularly. Reduce the heat as necessary to prevent burning. \n2. After 10 minutes, increase the heat to medium-high and continue cooking, stirring often and scraping the bottom of the pot with a wooden spoon, until the onions are deep brown and caramelized, about 40 to 50 minutes. If the bottom of the pot starts to get too dark, add 4 to 5 Tbsp water.\n3. Sprinkle the onions with the flour and stir in the cognac and cook, stirring, for 2 more minutes. Add the broth, bay leaves and thyme and simmer until the liquid is reduced to about 8 cups, about 18 to 20 minutes. Discard the herbs and stir in the sherry vinegar. Taste the soup and adjust the seasoning with salt and pepper.\n4. When you’re ready to serve, turn on your broiler. Place oven-safe ramekins on a rimmed baking sheet. For thicker soup, place half a slice of bread in the bottom of each bowl. Divide the soup between the bowls. Place a second bread slice on top of each bowl and sprinkle with cheese. Broil the soup until the cheese is golden brown and bubbling, about 2 minutes.","CuisineTime":"1 hr 30 mins","RecommendedAddress":"44110 Ashburn Shopping Pl Ste 196 Ashburn, VA 20147"，“Restaurant”:"ASHBURN PUB"},
    {"CuisineName":"Spaghtti Alla Carbonara","CuisineDescription":"Carbonara is made with guanciale (cured pork), eggs, Pecorino Romano cheese, spaghetti pasta, and lots of black pepper. Italians don't add extra ingredients like cream, milk, garlic, or onions. Try this recipe if you want to make an authentic, creamy carbonara that comes straight from Italy, where I live. Buon appetito!","CuisineWebsite":"https://www.allrecipes.com/recipe/245775/spaghetti-alla-carbonara-the-traditional-italian-recipe/","CuisineImage":"https://raw.githubusercontent.com/HongxinZheng/JSONProjectsIT315/master/carbonara.jpg","CuisineIngredient":"Oil, guanciale, spaghetti, eggs, cheese, and seasonings","CuisineMake":"1. Cook the pork in olive oil until browned and crispy, then drain on paper towels.\n2. Boil the spaghetti in salted water. Drain and return to the pot. Let cool.\n3. Whisk the eggs, 1/2 of the cheese, and some pepper in a bowl until smooth.\n4. Pour the egg mixture over the pasta, stirring quickly, until creamy.\n5. Stir in the pork, then top with the remaining cheese and more black pepper.","CuisineTime":"20 mins","RecommendedAddress":"4028 Cox Rd Ste O Glen Allen, VA 23060","Restaurant":"Mama Cucina Italian Restaurant"},
    {"CuisineName":"Homemade Lasagna","CuisineDescription":"Lasagna is the name of one of the oldest and best-known pasta shapes. It is usually rectangular or ribbon shaped, thicker than tagliatelle, made from a dough based on flour and eggs, with numerous local variants.","CuisineWebsite":"https://www.allrecipes.com/recipe/19344/homemade-lasagna/","CuisineImage":"https://raw.githubusercontent.com/HongxinZheng/JSONProjectsIT315/master/Lasagna.jpg","CuisineIngredient":"Meat, onion, tomatoes, fresh herbs, sugar, spices, seasonings, noodles, cheese and eggs","CuisineMake":"1. Cook the meat: Cook the ground meat in a skillet until browned and crumbly. Add the onion and continue cooking until it's translucent. Stir in the canned tomato products, half of the parsley, garlic, basil, 1.5 teaspoons of salt, oregano, and sugar.\n2. Cook the noodles: Boil the lasagna noodles in lightly salted water until they're al dente.\n3. Make the cheese layer: Mix cottage cheese, Parmesan cheese, eggs, the remaining parsley, the remaining salt, and pepper in a bowl.\n4. Assemble the lasagna: Layer the ingredients according to the recipe (starting with sauce and ending with mozzarella) until the lasagna is assembled.\n5. Bake the lasagna: Cover with foil and bake in the preheated oven for about half an hour. Remove the foil and continue baking until the top is golden brown.","CuisineTime":"2 hr 50 mins","RecommendedAddress":"4028 Cox Rd Ste O Glen Allen, VA 23060"，“Restaurant”:"Mama Cucina Italian Restaurant"}
  ],
  "Status":"OK"
}
